# Вводится целое неотрицательное число N. N ≤ 100.
# Формат вывода
# Выведите 2 в степени N.
n = int(input())
result = 2**n
print(result)