# Дано натуральное число. Выведите его последнюю цифру.
n = int(input())
result = n % 10
print(result)
