# Дано двузначное число. Найдите число десятков в нем.
n = int(input())
result = n//10%10
print(result)